# include<stdio.h>
int main()
{
 int n,a,b,c,d,e,f,y,x;//y存储2*2的空位数目，x存储1*1的空位数目，n是所需的箱子总数，a~f分别表示不同类型的箱子
 int w[4]={0,5,3,1};//为3*3的产品新开箱子时，剩余的空间分四种情况：1、3*3的产品数目正好是4的倍数，则无多余空间；
 //2、3*3的产品数目是4的倍数+1，此时还剩下5个2*2的空间和7个1*1的空间
 //2、3*3的产品数目是4的倍数+2，此时还剩下3个2*2的空间和6个1*1的空间
 //2、3*3的产品数目是4的倍数+3，此时还剩下1个2*2的空间和5个1*1的空间
 while(1)
 {
  scanf("%d%d%d%d%d%d",&a,&b,&c,&d,&e,&f);
  if(!a&&!b&&!c&&!d&&!e&&!f)
   break;
  n=f+e+d+(c+3)/4;//(c+3)/4正好等于c除以4向上取整
  y=5*d+w[c%4];//y存储2*2的空位数目
  if(b>y)
   n+=(b-y+8)/9;
  x=36*n-36*f-25*e-16*d-9*c-4*b;//x存储1*1的空位数目
  if(a>x)
   n+=(a-x+35)/36;
  printf("%d\n",n);
 }
 return 0;
}